src/DataProcessors/ПерерасчетЗарплатыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ПерерасчетЗарплатыОрганизаций</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодРегистрации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокРаботников</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РаботникНаименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокПодразделений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеНаименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/CalculationRegisters/ОсновныеНачисленияРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<CalculationRegister>
		<Properties>
			<Name>ОсновныеНачисленияРаботниковОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<Schedule>InformationRegister.ГрафикиРаботыПоВидамВремени</Schedule>
			<ScheduleValue>InformationRegister.ГрафикиРаботыПоВидамВремени.Resource.ОсновноеЗначение</ScheduleValue>
			<ScheduleDate>InformationRegister.ГрафикиРаботыПоВидамВремени.Dimension.Дата</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисленияОрганизаций</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтработаноДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтработаноЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтработаноДнейПоПятидневке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаДнейПоПятидневке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплаченоДнейЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтработаноЧасовПоПятидневке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаЧасовПоПятидневке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплаченоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчетаВремени</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчетаВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеДанные</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРасчетаСреднегоЗаработкаНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРасчетаСреднегоЗаработкаОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаСобытия</Name>
					<Comment>Дата начала события, оплачиваемого по среднему заработку</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Авторасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОбработкиЗаписиПриОтраженииВРеглУчете</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОбработкиЗаписиПриОтраженииВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантАлгоритмаРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыАлгоритмовРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРаботников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасыИзДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботыНорма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СторнируемыйДокумент</Name>
					<Comment>Документ, который зарегистрировал сторнируемое начисление</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Сторнирование</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаПраздничныхИВыходныхДнейОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.НевыходыВОрганизациях</v8:Type>
						<v8:Type>cfg:DocumentRef.ТабельУчетаРабочегоВремениОрганизации</v8:Type>
						<v8:Type>cfg:DocumentRef.РегистрацияПростоевРаботниковОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаСверхурочныхЧасов</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеОтпускаРаботникамОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеПоБольничномуЛисту</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаПоСреднемуЗаработку</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗарплатыРаботникамОрганизаций</v8:Type>
						<v8:Type>cfg:DocumentRef.РегистрацияРазовыхНачисленийРаботниковОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойРасчетСреднегоЗаработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерСреднегоЗаработка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ауМестоРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СЭ_МестаРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

src/InformationRegisters/ЗаполнениеПлановыхНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЗаполнениеПлановыхНачислений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектЗаполнения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗарплатыРаботникамОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/ПерерасчетЗарплатыОрганизаций/Ext/ObjectModule.bsl
Перем мПодразделенияДокументы Экспорт;  // соответствие подразделений и документов перерасчета
Перем мРаботникиДокументы Экспорт; // соответствие работников и документов перерасчета

// Заполняет список физлиц по которым необходимо пересчитать зарплату по заданной организации
// Параметры: 
//	Организация - ссылка на организацию
// Возвращаемое значение:
//	Нет
//
Процедура ЗаполнитьДанныеПоОрганизации() Экспорт
	
	мПодразделенияДокументы.Очистить();
	мРаботникиДокументы.Очистить();
	
	СписокПодразделений.Очистить();
	СписокРаботников.Очистить();
	
	// пока не выбрана организация ничего не делаем
	Если Организация.Пустая() Тогда
		СписокДокументов.Очистить();
		Возврат;
	КонецЕсли;
	
	//запомним какие документы отмечены в списке документов
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Пометка", Истина);
	ТаблицаДокументов = СписокДокументов.Выгрузить();
	МассивСтрок = ТаблицаДокументов.НайтиСтроки(СтруктураПоиска);
	СписокПомеченныхДокументов = ТаблицаДокументов.Скопировать(МассивСтрок);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация",	ОбщегоНазначения.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("ТекущийПериод",	ТекущийПериод);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПерерасчетОсновныхНачислений.ОбъектПерерасчета КАК Документ,
	|	ПерерасчетОсновныхНачислений.ОбъектПерерасчета.ПериодРегистрации КАК ПериодРегистрации
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ПерерасчетОсновныхНачислений КАК ПерерасчетОсновныхНачислений
	|ГДЕ
	|	ПерерасчетОсновныхНачислений.ОбъектПерерасчета.Организация = &Организация
	|	И ПерерасчетОсновныхНачислений.ОбъектПерерасчета.ПериодРегистрации < &ТекущийПериод
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПерерасчетДополнительныхНачислений.ОбъектПерерасчета,
	|	ПерерасчетДополнительныхНачислений.ОбъектПерерасчета.ПериодРегистрации
	|ИЗ
	|	РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций.ПерерасчетДополнительныхНачислений КАК ПерерасчетДополнительныхНачислений
	|ГДЕ
	|	ПерерасчетДополнительныхНачислений.ОбъектПерерасчета.Организация = &Организация
	|	И ПерерасчетДополнительныхНачислений.ОбъектПерерасчета.ПериодРегистрации < &ТекущийПериод
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПерерасчетСреднегоЗаработка.ОбъектПерерасчета,
	|	ПерерасчетСреднегоЗаработка.ОбъектПерерасчета.ПериодРегистрации
	|ИЗ
	|	РегистрРасчета.РасчетСреднегоЗаработка.ПерерасчетСреднегоЗаработка КАК ПерерасчетСреднегоЗаработка
	|ГДЕ
	|	ПерерасчетСреднегоЗаработка.ОбъектПерерасчета.Организация = &Организация
	|	И ПерерасчетСреднегоЗаработка.ОбъектПерерасчета.ПериодРегистрации < &ТекущийПериод
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЗаполнениеПлановыхНачислений.ОбъектЗаполнения,
	|	ЗаполнениеПлановыхНачислений.ПериодРегистрации
	|ИЗ
	|	РегистрСведений.ЗаполнениеПлановыхНачислений КАК ЗаполнениеПлановыхНачислений
	|ГДЕ
	|	ЗаполнениеПлановыхНачислений.ПериодРегистрации < &ТекущийПериод
	|	И ЗаполнениеПлановыхНачислений.ОбособленноеПодразделение = &Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодРегистрации";
	
	СписокДокументов.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Если СписокПомеченныхДокументов.Количество() > 0 Тогда
		
		МассивДокументов = СписокПомеченныхДокументов.ВыгрузитьКолонку("Документ");
		Для каждого ДокументСсылка Из МассивДокументов Цикл
			СтрокаСписка = СписокДокументов.Найти(ДокументСсылка, "Документ");
			Если Не СтрокаСписка = Неопределено Тогда
				СтрокаСписка.Пометка = Истина;
			КонецЕсли;	
		КонецЦикла;

	КонецЕсли;
	
КонецПроцедуры

// перерассчитать помеченные документы,
// в порядке от самого старого до самого нового.
Процедура Перерассчитать() Экспорт
	
	ИндексСтрокиТаблицы = СписокДокументов.Количество();
	Пока ИндексСтрокиТаблицы > 0 Цикл
		ИндексСтрокиТаблицы = ИндексСтрокиТаблицы - 1;
		
		СтрокаТаблицы = СписокДокументов[ИндексСтрокиТаблицы];
		Если СтрокаТаблицы.Пометка Тогда
			ДокументОбъект = СтрокаТаблицы.Документ.ПолучитьОбъект();
			Попытка
				ДокументОбъект.Перерассчитать();
			Исключение
				Сообщить("Документ " + Строка(ДокументОбъект) + " не может быть перерассчитан!
				|" + ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	ЗаполнитьДанныеПоОрганизации();
	
КонецПроцедуры

// удалить сведения о перерасчете помеченных документов
Процедура УдалитьСведенияОПерерасчете() Экспорт
	
	ПерерасчетыПоДокументам = РегистрыРасчета.ОсновныеНачисленияРаботниковОрганизаций.Перерасчеты.ПерерасчетОсновныхНачислений.СоздатьНаборЗаписей();
	ПерерасчетыПоДокументам.Отбор.ОбъектПерерасчета.Использование = Истина;
	ПерерасчетыПоДокументам.Отбор.ОбъектПерерасчета.ВидСравнения = ВидСравнения.Равно;
	
	ДопПерерасчетыПоДокументам = РегистрыРасчета.ДополнительныеНачисленияРаботниковОрганизаций.Перерасчеты.ПерерасчетДополнительныхНачислений.СоздатьНаборЗаписей();
	ДопПерерасчетыПоДокументам.Отбор.ОбъектПерерасчета.Использование = Истина;
	ДопПерерасчетыПоДокументам.Отбор.ОбъектПерерасчета.ВидСравнения = ВидСравнения.Равно;
	
	СредПерерасчетыПоДокументам = РегистрыРасчета.РасчетСреднегоЗаработка.Перерасчеты.ПерерасчетСреднегоЗаработка.СоздатьНаборЗаписей();
	СредПерерасчетыПоДокументам.Отбор.ОбъектПерерасчета.Использование = Истина;
	СредПерерасчетыПоДокументам.Отбор.ОбъектПерерасчета.ВидСравнения = ВидСравнения.Равно;
	
	НаборПерезаполнения = РегистрыСведений.ЗаполнениеПлановыхНачислений.СоздатьНаборЗаписей();
	НаборПерезаполнения.Отбор.ОбъектЗаполнения.Использование = Истина;
	НаборПерезаполнения.Отбор.ОбъектЗаполнения.ВидСравнения = ВидСравнения.Равно;
	
	Для Каждого СтрокаТаблицы Из СписокДокументов Цикл
		Если СтрокаТаблицы.Пометка Тогда
			ТипРегистратора = ТипЗнч(СтрокаТаблицы.Документ);
			Если ПерерасчетыПоДокументам.Отбор.ОбъектПерерасчета.ТипЗначения.СодержитТип(ТипРегистратора) тогда
				ПерерасчетыПоДокументам.Отбор.ОбъектПерерасчета.Значение = СтрокаТаблицы.Документ;
				ПерерасчетыПоДокументам.Записать(Истина);
			КонецЕсли;
			Если ДопПерерасчетыПоДокументам.Отбор.ОбъектПерерасчета.ТипЗначения.СодержитТип(ТипРегистратора) тогда
				ДопПерерасчетыПоДокументам.Отбор.ОбъектПерерасчета.Значение = СтрокаТаблицы.Документ;
				ДопПерерасчетыПоДокументам.Записать(Истина);
			КонецЕсли;
			Если СредПерерасчетыПоДокументам.Отбор.ОбъектПерерасчета.ТипЗначения.СодержитТип(ТипРегистратора) тогда
				СредПерерасчетыПоДокументам.Отбор.ОбъектПерерасчета.Значение = СтрокаТаблицы.Документ;
				СредПерерасчетыПоДокументам.Записать(Истина);
			КонецЕсли;
			Если НаборПерезаполнения.Отбор.ОбъектЗаполнения.ТипЗначения.СодержитТип(ТипРегистратора) Тогда
				НаборПерезаполнения.Отбор.ОбъектЗаполнения.Значение = СтрокаТаблицы.Документ;
				НаборПерезаполнения.Записать(Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьДанныеПоОрганизации();
	
КонецПроцедуры

// заполняет табличную часть СписокПодразделений и соответсвие мПодразделенияДокументы 
// предназначенные для выполнения команды "отметить по подразделениеям"
Процедура ЗаполнитьСписокПодразделений() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ТекущийПериод", ТекущийПериод);
	Запрос.УстановитьПараметр("Организация", Организация);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Перерасчет.ФизЛицо КАК ФизЛицо,
	|	Перерасчет.ОбъектПерерасчета КАК Документ
	|ПОМЕСТИТЬ ВТСписокФизлиц
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ПерерасчетОсновныхНачислений КАК Перерасчет
	|ГДЕ
	|	Перерасчет.ОбъектПерерасчета.Организация = &Организация
	|	И Перерасчет.ОбъектПерерасчета.ПериодРегистрации < &ТекущийПериод
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Перерасчет.ФизЛицо,
	|	Перерасчет.ОбъектПерерасчета КАК Документ
	|ИЗ
	|	РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций.ПерерасчетДополнительныхНачислений КАК Перерасчет
	|ГДЕ
	|	Перерасчет.ОбъектПерерасчета.Организация = &Организация
	|	И Перерасчет.ОбъектПерерасчета.ПериодРегистрации < &ТекущийПериод
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Перерасчет.Физлицо,
	|	Перерасчет.ОбъектПерерасчета КАК Документ
	|ИЗ
	|	РегистрРасчета.РасчетСреднегоЗаработка.ПерерасчетСреднегоЗаработка КАК Перерасчет
	|ГДЕ
	|	Перерасчет.ОбъектПерерасчета.Организация = &Организация
	|	И Перерасчет.ОбъектПерерасчета.ПериодРегистрации < &ТекущийПериод
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаполнениеПлановыхНачислений.Сотрудник.Физлицо,
	|	ЗаполнениеПлановыхНачислений.ОбъектЗаполнения КАК Документ
	|ИЗ
	|	РегистрСведений.ЗаполнениеПлановыхНачислений КАК ЗаполнениеПлановыхНачислений
	|ГДЕ
	|	ЗаполнениеПлановыхНачислений.ПериодРегистрации < &ТекущийПериод
	|	И ЗаполнениеПлановыхНачислений.ОбособленноеПодразделение = &Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизЛицо";
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Перерасчеты.Документ КАК Документ,
	|	ВЫБОР
	|		КОГДА Работники.ПериодЗавершения <= &ТекущийПериод
	|				И Работники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Работники.ПодразделениеОрганизацииЗавершения.Наименование
	|		ИНАЧЕ Работники.ПодразделениеОрганизации.Наименование
	|	КОНЕЦ КАК ПодразделениеНаименование,
	|	ВЫБОР
	|		КОГДА Работники.ПериодЗавершения <= &ТекущийПериод
	|				И Работники.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА Работники.ПодразделениеОрганизацииЗавершения
	|		ИНАЧЕ Работники.ПодразделениеОрганизации
	|	КОНЕЦ КАК Подразделение
	|ИЗ
	|	ВТСписокФизлиц КАК Перерасчеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|				&ТекущийПериод,
	|				Организация = &Организация
	|					И Сотрудник.Физлицо В
	|						(ВЫБРАТЬ ФизЛицо ИЗ ВТСписокФизлиц)) КАК Работники
	|		ПО Перерасчеты.ФизЛицо = Работники.Сотрудник.Физлицо
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПодразделениеНаименование";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДокументыМассив = мПодразделенияДокументы.Получить(Выборка.Подразделение);
		Если ДокументыМассив = НеОпределено Тогда
			ДокументыМассив = Новый Массив;
			ДокументыМассив.Добавить(Выборка.Документ);
			мПодразделенияДокументы[Выборка.Подразделение] = ДокументыМассив;
			Строка = СписокПодразделений.Добавить();
			Строка.Подразделение = Выборка.Подразделение;
			Строка.ПодразделениеНаименование = Выборка.ПодразделениеНаименование;
		Иначе
			ДокументыМассив.Добавить(Выборка.Документ);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// заполняет табличную часть СписокРаботников и соответсвие мРаботникиДокументы 
// предназначенные для выполнения команды "отметить по подразделениям"
Процедура ЗаполнитьСписокРаботников() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ТекущийПериод", ТекущийПериод);
	Запрос.УстановитьПараметр("Организация", Организация);

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Перерасчет.ФизЛицо КАК ФизЛицо,
	|	Перерасчет.ФизЛицо.Наименование КАК ФизЛицоНаименование,
	|	Перерасчет.ОбъектПерерасчета КАК Документ
	|ИЗ
	|	РегистрРасчета.ОсновныеНачисленияРаботниковОрганизаций.ПерерасчетОсновныхНачислений КАК Перерасчет
	|ГДЕ
	|	Перерасчет.ОбъектПерерасчета.Организация = &Организация
	|	И Перерасчет.ОбъектПерерасчета.ПериодРегистрации < &ТекущийПериод
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Перерасчет.ФизЛицо,
	|	Перерасчет.ФизЛицо.Наименование,
	|	Перерасчет.ОбъектПерерасчета
	|ИЗ
	|	РегистрРасчета.ДополнительныеНачисленияРаботниковОрганизаций.ПерерасчетДополнительныхНачислений КАК Перерасчет
	|ГДЕ
	|	Перерасчет.ОбъектПерерасчета.Организация = &Организация
	|	И Перерасчет.ОбъектПерерасчета.ПериодРегистрации < &ТекущийПериод
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Перерасчет.Физлицо,
	|	Перерасчет.Физлицо.Наименование,
	|	Перерасчет.ОбъектПерерасчета
	|ИЗ
	|	РегистрРасчета.РасчетСреднегоЗаработка.ПерерасчетСреднегоЗаработка КАК Перерасчет
	|ГДЕ
	|	Перерасчет.ОбъектПерерасчета.Организация = &Организация
	|	И Перерасчет.ОбъектПерерасчета.ПериодРегистрации < &ТекущийПериод
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаполнениеПлановыхНачислений.Сотрудник.Физлицо,
	|	ЗаполнениеПлановыхНачислений.Сотрудник.Физлицо.Наименование,
	|	ЗаполнениеПлановыхНачислений.ОбъектЗаполнения
	|ИЗ
	|	РегистрСведений.ЗаполнениеПлановыхНачислений КАК ЗаполнениеПлановыхНачислений
	|ГДЕ
	|	ЗаполнениеПлановыхНачислений.ПериодРегистрации < &ТекущийПериод
	|	И ЗаполнениеПлановыхНачислений.ОбособленноеПодразделение = &Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФизЛицоНаименование";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДокументыМассив = мРаботникиДокументы.Получить(Выборка.Физлицо);
		Если ДокументыМассив = НеОпределено Тогда
			ДокументыМассив = Новый Массив;
			ДокументыМассив.Добавить(Выборка.Документ);
			мРаботникиДокументы[Выборка.Физлицо] = ДокументыМассив;
			Строка = СписокРаботников.Добавить();
			Строка.Работник = Выборка.Физлицо;
			Строка.РаботникНаименование = Выборка.ФизЛицоНаименование;
		Иначе
			ДокументыМассив.Добавить(Выборка.Документ);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

мПодразделенияДокументы = Новый Соответствие;
мРаботникиДокументы = Новый Соответствие;
